[INDEX]
TYPE=dictionary
NAME=English
LANGUAGE=english
ISO2=EN
AUTHOR=MastaMan
WEB=https://3dground.net
DESCRIPTION=English translation for Prune Scene script
VERSION=1.0.0
NOTE=Use symbol " | " for break the line. And " || " for brake twice. Example: Lorem ipsum | dolor sit amet || Fish text

[UI]
~DETAILS~=Details
~ONLINE_HELP~=Get Online Help
~SELECT~=Select
~RUN~=>> Run Scan

~MAIN_STATUS_DISABLED~=DISABLED
~MAIN_STATUS_CLEARED~=CLEARED
~MAIN_STATUS_NOT_FOUND~=NOT FOUND
~MAIN_STATUS_WAIT~=WAIT...
~MAIN_START~=Clear scene
~MAIN_PRUNE_SCENE_OPTIONS~=Prune Scene Options
~MAIN_CHECK_ALL~=Check All
~MAIN_UNCHECK_ALL~=Uncheck All
~MAIN_OPEN_ONLINE_MANUAL~=Open Online Manual (How To Use?)
~MAIN_MSG_PLEASE_SELECTE_ATLEAST_ONE_OPTION~=Please select at least one option!

~AP_FINDER_STATUS~=Active Protection Status
~AP_RT~=Realtime scene protection
~AP_ACTIVE~=PROTECTION ACTIVE
~AP_DISABLED~=PROTECTION DISABLED
~AP_LOADING~=LOADING PLEASE WAIT...
~AP_INSTANT_SCAN~=Instant Scan
~AP_INSTANT_SCAN_DESC~=Scan for threats just now
~AP_INSTANT_SCAN_FIND~=Instant Scan Current Scene
~AP_INSTANT_SCAN_DETAILS_DESK~=How to notify when detected threat
~AP_INSTANT_SCAN_SHOW_LOG~=Show Log
~AP_INSTANT_SCAN_SIGNATURES~=Signatures For Detect Threats
~AP_INSTANT_SCAN_LAST_UPDATE~=Last update

~SELECTIVE_SCAN~=Selective Scan
~SELECTIVE_SCAN_DESK~=Find viruses without open the scene!
~SELECTIVE_SCAN_SEL_FOLDER~=Select folder for Selective Scan
~SELECTIVE_SCAN_READY_FOR_SCAN~=Ready for scan
~SELECTIVE_SCAN_THREAT_FILES~=Threat Files
~SELECTIVE_SCAN_TOTAL_SCANNED~=Total Scanned
~SELECTIVE_SCAN_SCANNING~=Scanning...
~SELECTIVE_SCAN_MSG_SELECT_FOLDER_FOR_SCAN~=Please select folder for scan!
~SELECTIVE_SCAN_DETECTED_THREADS~=Detected Threats
~SELECTIVE_SCAN_MSG_DONE_1~=Scan Result
~SELECTIVE_SCAN_MSG_DONE_2~=Safe, no threats detected!
~SELECTIVE_SCAN_MSG_DONE_3~=Threats have been detected! More info press the "Detected Threats"

~MODALS_DATE~=Date
~MODALS_TYPE~=Type
~MODALS_MESSAGE~=Message
~MODALS_PATH~=Path
~MODALS_THREAT~=Threat
~MODALS_WARNING~=Warning
~MODALS_DEFAULT~=Default
~MODALS_CLEAR_ALL_LOG~=Clear All Log
~MODALS_VIRUS_REMOVED_FOR~=virus detected and removed for
~MODALS_DETECTED_BUT_NOT_REMOVED~=virus detected but not removed from startup folder!
~MODALS_DISINFECT~=Disinfect
~MODALS_IGNORE~=Ignore
~MODALS_SELECT_FILE_FROM_LIST_MSG~=Please select file from list!
~MODALS_OPEN_AND_PRUNE_VIRUSES_MSG~=Do you really want to open and prune viruses for
~MODALS_ERROR_OPEN_FILE_MSG~=Error occured when open file
~MODALS_ERROR_OPEN_FILE_MSG2~=This can happen if the version of the saved file is different from the 3Ds Max!
~MODALS_VIRUSES_REMOVED_FROM_MSG~=Viruses removed from
~MODALS_VIRUSES_REMOVED_FROM_MSG2~=Please save current scene with new name!
~MODALS_DELETE_FILE_MSG~=Do you really want to remove file
~MODALS_DELETE_FILE_MSG2~=from Detected Threats?

~SIGNATURE_SUCCESS_NO_VIRUS~=Success! Viruses not detected!
~SIGNATURE_DETECTED_AND_REMOVED~=virus detected and removed!
~SIGNATURE_FIX_FILES_MSG~=In next files found CRP Bscript virus! Do you want to fix it?
~SIGNATURE_FIX_FILES_MANUALLY_MSG~=Next files not repaired! Do you want fix it manually?
~MODALS_BATCH_NO_FILES_MSG~=There are no files for batch processing in the list!
~MODALS_BATCH_DISINFECT~=Batch Disinfect Files
~MODALS_BATCH_DONE_SUCCESS_MSG~=Batch processing of files completed successfully!
~REST_DEF_PRJ_PATHS~=Restore Default Project Paths
~REST_PATH_TO_DEFAULTS_INFO~=Revert all paths to defaults
~REST_BTN_TO_DEFAULTS~=Revert Paths
~MSG_REST_SUCCES_REC_CFG_PATHS~=Project Config Paths (@CNT1@) restored to default! | Unused External and XRef Paths (@CNT2@) removed!
~MSG_QUERY_RESTORE_CFG_PATH~=Are you sure you want to restore all the paths in the Configure Project Paths? | This operation cannot be undone!
~MODALS_BATCH_WARN_MSG~=ATTENTION! | You cannot stop this operation until all files have been processed! | This operation may take from several minutes to several hours, depending on the number of files ... || Warning and Disclaimer (You do everything at your own peril and risk): || - Files will be re-saved for the current version of 3Ds Max | - Large files may freeze 3Ds Max when opened | - Some files may cause crashes or unexpected errors and may not be written correctly (data loss) | - During batch processing, some objects from scenes can be deleted or renamed | - Some files may not be processed due to an older version of 3Ds Max || By clicking the confirmation button, you agree that you have made a preliminary backup of your files | and agree to the disclaimer of data loss or other consequences of this operation!
~SEARCH_IN_SUBFOLDERS~=Search in Subfolders
~SKIPPED~=Skipped
~TOTAL_PROCESSED~=Total processed
~RUN_BATCH_CLEANUP~=Run Batch Cleanup
~BATCH_CLEANUP_SELECT_FOLDER~=Select folder for Batch Cleanup
~FILES~=files
~BATCH_PRUNE~=Bulk garbage removal
~BATCH_PRUNE_INFO~=Searching scenes on HDD
~MODALS_BATCH_PRUNE_SELECT_OPTIONS~=Please select at least one cleanup option in rollout Main
~MODALS_BATCH_PRUNE_NO_SCENES_IN_FOLDER~=There are no scenes in this folder!

[LICENSE]
~LIC_AGREEMENT~=Please buy full version of @SCRIPT@. || If you want this window no longer shows, buy the license key. || You can use the license key only for two computers! || The script is free, but you can buy it to continue developing. ||  | https://3dground.net | e-mail: scripts.autodesk@gmail.com
~LIC_LICENSE_KEY~=License Key
~LIC_PLEASE_BUY_LICENSE_KEY~=Please use license key, or purchase the script!
~LIC_FOR_CLOSE_WINDOW_PRESS~=For close this window press button
~LIC_LICENSE_EXPIRES~=License type / License expires:
~LIC_CLEAR_LICENSE~=Clear License
~LIC_ENTER_LICENSE_KEY~=Enter Licese Key
~LIC_BUY~=>> Press here for buy Licese Key <<
~LIC_PRODUCT_PAGE~=Go to product page >>
~LIC_TRIAL~=Trial
~LIC_NEVER~=Permanent license

[UPDATE]
~UPD_UPDATER_WIZARD~=Automatic Updater Wizard
~UPD_BUY_TO_UP~=Please buy a license | for free to update!
~UPD_HAS_LICENSE~=With your license you get lifetime updates! | Press button for check new updates... | Current version:
~UPD_CHECK_UPDATES~=Check For Updates
~UPD_CANT_RUN_UPDATER~=Can't run updater!
~UPD_CHECK_FOR_UPDATES~=Check for updates...
~UPD_RELEASE_NOTES~=Release notes
~UPD_CANT_CONNECT_TO_SERVER~=Can't connect to server :(
~UPD_AVAILABLE_NEW_VERSION~=Available new version
~UPD_U_USING_LATEST_VER~=You are using the latest version!
~UPD_DOWNLOAD_PACKAGE~=Downloading Package...
~UPD_UNPACK_FILES~=Unpack files...
~UPD_UPDATES_INSTALLED~=Updates have been installed!
~UPD_RESTART_THE_SCRIPT~=Please restart the script!
~UPD_UNKNOWN_ERROR~=An error has occurred!
~UPD_UPDATE_TO_LATEST_VER~=Update To Latest Version
~UPD_PLEASE_BUY_LICENSE_KEY~=This feature is only available to users who have purchased a license key!
~UPD_TITLE_PLEASE_BUY_LICENSE_KEY~=Please purchase license key!

[INSTALL]
~INSTALL_NEXT~=Next
~INSTALL_BACK~=Back
~INSTALL_S0_CHOOSE_YOUR_LANG~=Selecting the language of the interface text
~INSTALL_S0_YOUR_LANGUAGE~=Your language
~INSTALL_S1_LICENSE_AGREEMENT~=I accept the term in the license agreement
~INSTALL_S0_TITLE~=Language Setup
~INSTALL_S1_TITLE~=Please read the following information
~INSTALL_S1_LICENSE~=You can use all the features of this script for free. |                             _____________________________________________ || Obtain the license: | - You disable the license window at startup | - You can update the script by clicking one button "Check for update" | - You will receive full customer support | - You will be able to participate in the development of the script || One key is for one user only, a maximum of 2 computers (Home and Work). |                             _____________________________________________ || Official website: https://3dground.net
~INSTALL_S2_TITLE~=Installing options
~INSTALL_S2_REGISTER_MENUS~=Register interface menus
~INSTALL_S2_REGISTER_MENUS_DESC~=This setting helps to create their own buttons in the interface.
~INSTALL_S2_REG_TOOLBAR~=Tool Bar (Recommended)
~INSTALL_S2_SETUP_OPTIONS~=Setup options
~INSTALL_S2_SETUP_OPTIONS_DESC~=Select whether you want to install or remove
~INSTALL_S2_SETUP_OPTIONS_INSTALL~=Install
~INSTALL_S2_SETUP_OPTIONS_REMOVE~=Remove
~INSTALL_FINISH~=Finish
~INSTALL_HELP~=Help
~INSTALL_ABOUT~=About
~INSTALL_RUN_SCRIPT~=Run Script
~INSTALL_S3_INSTALL_SCRIPT~=Install script
~INSTALL_S3_REMOVE_SCRIPT~=Remove script
~INSTALL_S3_INST_SUCCESS~=Installed success!
~INSTALL_S3_REM_FAILED~=Uninstall failed!
~INSTALL_S3_INST_FAILED~=Installation failed!
~INSTALL_S3_REM_SUCCESS~=Uninstall success!
~INSTALL_ERR_RUN_SCRIPT~=Can't run the script :(
~INSTALL_MANUAL_BUTTON~=Quick guide if buttons/menus are not added: | 1. Go to Customize -> Customize User Interface -> Toolbars | 2. Select the category @CAT@ | 3. Drag&Drop @SCRIPT@ to the toolbar 
~INSTALL_S2_ICON_TYPE~=Use HiDPI icons
~INSTALL_S2_SETUP_OPTIONS_YES~=Yes (Recommended)
~INSTALL_S2_SETUP_OPTIONS_NO~=No

[LANGUAGE]
~LNG_AUTHOR~=Author
~LNG_VERSION~=Version
~LNG_INFO_ABOUT_TRANSLATE~=Info about translation

[TOOLTIPS]

~TOOLTIP_TITLE_NOTE_TRACKS~=Remove Track Notes
~TOOLTIP_NOTE_TRACKS~=Note Tracks appear at Merge, Import, X-Ref models or | automatically, and can significantly increase the size of the scenes. 

~TOOLTIP_TITLE_GARBAGE~=Remove Local Garbage Collection
~TOOLTIP_GARBAGE~=When memory run low garbage cleared automatically, | but until that time, the garbage will accumulate in | the scene and to increase its size. 

~TOOLTIP_TITLE_MEMORY~=Flush Memory
~TOOLTIP_MEMORY~=It clears the Undo Buffer, - history of recent actions. | Also removes the Bitmap Cache. || WARNING: | After using this option, you may no longer | be displayed texture in the viewport!

~TOOLTIP_TITLE_REACTOR~=Reactor Collisions
~TOOLTIP_REACTOR~=This option is relevant for older versions | of 3D Studio Max.

~TOOLTIP_TITLE_ANIMLAYERS~=Remove Anim Layers
~TOOLTIP_ANIMLAYERS~=Removes animation layers that increase the size | of the scene. These layers can be created automatically, | even if you have a static scene, without animation. || WARNING: | This operation can break your animation!

~TOOLTIP_TITLE_MISSING_OBJECTS~=Remove Missing Objects
~TOOLTIP_MISSING_OBJECTS~=Removes objects by external plugins, | which are not connected, and objects that are | not correctly imported into the scene. || This option also removes blank objects. | (objects with 0 polygons and empty groups).

~TOOLTIP_TITLE_MISSING_BITMAPS~=Clear Missing Bitmaps
~TOOLTIP_MISSING_BITMAPS~=Removes the path for non-existent textures. | This feature helps to avoid errors | Missing External Files at the opening scene... || WARNING: | Be careful if you transferred or created a | new scene and did not have time to assign textures | the path through Utilites -> Bitmap / Phonometric Paths, | you can reset all the paths textures!

~TOOLTIP_TITLE_EMPTY_LAYERS~=Remove Empty Layers
~TOOLTIP_EMPTY_LAYERS~=Removes layers in which no object. | Sometimes when you import drawings from | AutoCAD or Merge 3ddd.ru/3dsky.org models | of the scene can be created unwanted empty layers. || This option will remove them | (also removes nested layers).

~TOOLTIP_TITLE_ANIMATION_KEYS~=Remove Animation Keys
~TOOLTIP_ANIMATION_KEYS~=Removes all animation keys. || WARNING: | If you have in the scene contains | the desired animation, uncheck this option! | Otherwise, all the animation will be removed!

~TOOLTIP_TITLE_PARTICLE_VIEW~=Removes Particles
~TOOLTIP_PARTICLE_VIEW~=Removes all Particles and objects named "Particle_View_001" ... || If your scene does not have Particle animation, | you can safely use this option. 

~TOOLTIP_TITLE_MISSING_CORONA_RENDERER_ASSETS~=Remove CoronaRenderer Missing Assets
~TOOLTIP_MISSING_CORONA_RENDERER_ASSETS~=Removes garbage from old versions Corona Renderer in AssetsTracker. || - Removes HDCache.hdc | - Removes missing LUT files (*.cube)

~TOOLTIP_TITLE_ACTIVE_PROTECTION_STATUS~=Active Protection
~TOOLTIP_ACTIVE_PROTECTION_STATUS~=Helps to remove scripted viruses. || To enable protection, click on the red button | and the virus scan will start immediately. | If the protection button is green, | this means that the protection will | be triggered each time the 3Ds Max is started. | Also, virus cleanup will be performed | each time the scene is opened or | restarted. | The conditions for verification depend | on the signatures. || Please read more info about ALC and CRP viruses in official manual!

~TOOLTIP_TITLE_ACTIVE_PROTECTION_INSTANT_SCAN~=Instant Scan Current Scene
~TOOLTIP_ACTIVE_PROTECTION_INSTANT_SCAN~=Helps you to detect and delete viruses only in the current scene.

~TOOLTIP_TITLE_ACTIVE_PROTECTION_LOG~=Details
~TOOLTIP_ACTIVE_PROTECTION_LOG~=If the virus was found you will receive a notification: || PopUp's and Log - Message Box and Log. | PopUp's - Only Message Box. | Log - Only Log. In this mode, any confirmation | messages will be applied automatically (Quiet mode). || For display log press the "Show Log".

~TOOLTIP_TITLE_SELECTIVE_SCAN_THREAT_FILES~=Threat Files
~TOOLTIP_SELECTIVE_SCAN_THREAT_FILES~=Displays the number of infected *.max files. | If the value is greater than 0, this means that you have infected * .max files, | which you must necessarily cure.

~TOOLTIP_TITLE_SELECTIVE_SCAN_TOTAL_SCANNED~=Total Scanned
~TOOLTIP_SELECTIVE_SCAN_TOTAL_SCANNED~=Displays the total number of scanned *.max files.

~TOOLTIP_TITLE_SELECTIVE_SCAN_FINDER~=Selective Scan
~TOOLTIP_SELECTIVE_SCAN_FINDER~=Virus scan *.max files without opening them. | This method works quite quickly. | You can select one folder or even a whole drive (C:\, D:\, etc.). || WARNING: | Scanning a whole partition can take up to 15 minutes!

~TOOLTIP_INFO_ABOUT_TRANSLATE~=Info about translation
~TOOLTIP_TITLE_ROOT_CA~=Remove Root Custom Attributes
~TOOLTIP_ROOT_CA~=Removes junk Custom Attributes at the root of the scene that slows down 3Ds Max. | This option completely clears the attributes: day1RefCA, D1_FileNotes, NoteCount.
~TOOLTIP_TITLE_MISSING_PLUGINS~=Cleans Missing Plugins
~TOOLTIP_MISSING_PLUGINS~=Cleans up remnants of unconnected plugins in the scene. | Helps to avoid Missing Dlls error at scene start. || Removes junk from plugins: mrmaterialattribs, berconnoise, complexior, | complexfresnel, thinfilm, sigernoise, sigerscratches, etc. || ATTENTION: | Removing plugins from the scene may affect the final result on the display | materials, textures, objects in the scene and render.
~TOOLTIP_TITLE_RESTORE_CFG_PATHS~=Restore default Project Config Paths
~TOOLTIP_RESTORE_CFG_PATHS~=From time to time, when changing a project, opening a model, infecting, crashing, or because of an attached * .mxp file, the path settings may change. || This option returns paths from Customize -> Configure Project Paths -> File I/O to their default values. || ATTENTION! | The nonexistent paths from the External and XRef tabs will be removed.
~TOOLTIP_TITLE_JUNK_EFFECTS~=Remove Junk Effects
~TOOLTIP_JUNK_EFFECTS~=Removes duplicate junk effects from Environment and Effects that | increase the size of the scene. | Cleaning is triggered if more than 5 effects are found. || WARNING: | If the scene has the desired effects, disable this option.
~TOOLTIP_FORCE_UPDATED~=The version of the script is too outdated and will be forcibly updated to the latest version! | Please restart the script! || If you have problems with automatic updates, download and install PruneScene manually from https://3dground.net
~TOOLTIP_TITLE_BATCH_PRUNE_INFO~=Bulk processing of scenes
~TOOLTIP_TITLE_BATCH_SKIPPED~=Missing files
~TOOLTIP_TITLE_BATCH_TOTAL_PROCESSED~=Total processed
~TOOLTIP_BATCH_PRUNE_INFO~=Cleaning *.max files from garbage and viruses. | The process automates scene opening, cleanup and saving. | For cleaning, the options specified in the Main section are used. || ATTENTION: | - This process can corrupt your files! | - You must understand what options you need to select in the Main section! | - All files will be re-saved for the current version of 3Ds Max! | - Objects and other assets can be deleted in scenes! | - If you don't understand how cleaning works, | it is highly not recommended to run a mass cleanup!
~TOOLTIP_BATCH_SKIPPED~=Number of unprocessed *.max files. | For example, due to incompatibility of 3Ds Max versions.
~TOOLTIP_BATCH_TOTAL_PROCESSED~=Total number of *.max files processed.
